#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d2er6jry7l1se1]
aws_amplify_branch.dev: Refreshing state... [id=d2er6jry7l1se1/dev]
aws_amplify_branch.main: Refreshing state... [id=d2er6jry7l1se1/main]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d2er6jry7l1se1/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_amplify_app.thomaskimble_frontend will be updated in-place
  ~ resource "aws_amplify_app" "thomaskimble_frontend" {
        id                            = "d2er6jry7l1se1"
        name                          = "thomaskimble-frontend"
        tags                          = {}
        # (14 unchanged attributes hidden)

      + auto_branch_creation_config {
          + enable_auto_build = true
        }

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.thomaskimble_dev_cname will be created
  + resource "aws_route53_record" "thomaskimble_dev_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.thomaskimble.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.thomaskimble_legacy_cname will be created
  + resource "aws_route53_record" "thomaskimble_legacy_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "legacy.thomaskimble.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.thomaskimble will be created
  + resource "aws_route53_zone" "thomaskimble" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_dev will be created
  + resource "aws_route53_zone" "thomaskimble_dev" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_legacy will be created
  + resource "aws_route53_zone" "thomaskimble_legacy" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "legacy.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_www will be created
  + resource "aws_route53_zone" "thomaskimble_www" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "www.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*